In [74]:
import pandas as pd
from numpy import random

# Creando un DataFrame

In [75]:
df = pd.read_csv('../../../Downloads/mastermind-220421-143506.csv', index_col = [0])

In [76]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

## Desde un diccionario

In [77]:
dates = {"nombre": ["SFDX Show", "Sara Nogark","Nate Gentille", "Bettatech", "Antonio Sarosi", "Edgar Pons", "S4vitar"],
        "especialidad": list(df["especialidad"]),
        "Edad": [random.randint(28,32) for _ in range (len(df["nombre"]))],
        "Visitas": [random.randint(1000,2000) for _ in range (len(df["nombre"]))]}

In [78]:
df_inventado = pd.DataFrame(dates)

In [79]:
df_inventado

           nombre         especialidad  Edad  Visitas
0       SFDX Show             Hardware    30     1732
1     Sara Nogark     Edición de vídeo    28     1205
2   Nate Gentille         Programación    28     1519
3       Bettatech         Programación    31     1767
4  Antonio Sarosi  Sistemas Operativos    28     1080
5      Edgar Pons             Robótica    31     1010
6         S4vitar              Hacking    28     1524

In [80]:
df_inventado["sexo"] = ["H", "M", "H", "H", "H", "H", "H"]

In [81]:
df_inventado

           nombre         especialidad  Edad  Visitas sexo
0       SFDX Show             Hardware    30     1732    H
1     Sara Nogark     Edición de vídeo    28     1205    M
2   Nate Gentille         Programación    28     1519    H
3       Bettatech         Programación    31     1767    H
4  Antonio Sarosi  Sistemas Operativos    28     1080    H
5      Edgar Pons             Robótica    31     1010    H
6         S4vitar              Hacking    28     1524    H

# Explorando un DataFrame

In [82]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

## sf.head()

In [83]:
df.head(-1) #Si se coloca en negativo, simplemente resta ese numero de filas del final

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H

## df.tail()

In [84]:
df.tail(1)

    nombre especialidad  edad  visitas sexo
6  s4vitar      Hacking    28   132567    H

## df.sample()

In [85]:
df.sample()

           nombre         especialidad  edad  visitas sexo
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

## df.info()

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nombre        7 non-null      object
 1   especialidad  7 non-null      object
 2   edad          7 non-null      int64
 3   visitas       7 non-null      int64
 4   sexo          7 non-null      object
dtypes: int64(2), object(3)
memory usage: 336.0+ bytes

## df.describe()

In [87]:
df.describe()["edad"]["max"]

31.0

## df.shape

In [88]:
df.shape #Filas x Columnas

(7, 5)

## df.columns

In [89]:
df.columns

Index(['nombre', 'especialidad', 'edad', 'visitas', 'sexo'], dtype='object')

In [90]:
df.columns = ['nombre', 'especialidad', 'anos', 'visitas', 'sexo']

In [91]:
df.sample()

         nombre  especialidad  anos  visitas sexo
2  Nate Gentile  Programación    31   142545    H

In [92]:
df.columns = ['nombre', 'especialidad', 'edad', 'visitas', 'sexo']

In [93]:
df.columns

Index(['nombre', 'especialidad', 'edad', 'visitas', 'sexo'], dtype='object')

## df.index

In [94]:
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

# Seleccion de elementos (Subset)

## Acceso mediante etiquetas

In [95]:
df.head()

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [96]:
df["especialidad"][2]

'Programación'

In [97]:
df[df["nombre"] == "Nate Gentile"]["nombre"]
#Aca llamamos una condicion dentro del DataFrame, lo ultimo es lo que quiero que me mueste

2    Nate Gentile
Name: nombre, dtype: object

## df.iloc[ ]

In [98]:
df.head()

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [99]:
df.iloc[6,0:2]  #df.iloc[indice, columna] # No es inclusivo el ultimo valor, es decir hay que poner un numero mayor al que bus

nombre          s4vitar
especialidad    Hacking
Name: 6, dtype: object

## df.loc

In [100]:
df.head(7)

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [101]:
df.loc[2, "nombre": "especialidad"]  #df.loc[indice_fila, nombre_columna] #Si es inclusivo

nombre          Nate Gentile
especialidad    Programación
Name: 2, dtype: object

In [102]:
df.loc[2, "nombre": "especialidad"] == df.iloc[2,0:2]

nombre          True
especialidad    True
Name: 2, dtype: bool

# Manipulacion de datos

## Cambiar indice

### df.set_index()

In [105]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [122]:
df.set_index("nombre", inplace=True)

In [123]:
df

                       especialidad  edad  visitas sexo
nombre
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición de vídeo    29   114175    M
Nate Gentile           Programación    31   142545    H
Bettatech              Programación    31   149462    H
Antonio Sarosi  Sistemas Operativos    28   132008    H
Edgar Pons                 Robótica    29   143620    H
s4vitar                     Hacking    28   132567    H

In [124]:
df.reset_index(inplace = True)

In [125]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [126]:
df_nuevo = df.set_index("nombre")

In [127]:
df_nuevo

                       especialidad  edad  visitas sexo
nombre
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición de vídeo    29   114175    M
Nate Gentile           Programación    31   142545    H
Bettatech              Programación    31   149462    H
Antonio Sarosi  Sistemas Operativos    28   132008    H
Edgar Pons                 Robótica    29   143620    H
s4vitar                     Hacking    28   132567    H

In [132]:
df_nuevo.loc[["Nate Gentile", "s4vitar"], ["edad", "visitas"]]

              edad  visitas
nombre
Nate Gentile    31   142545
s4vitar         28   132567